Repository: EternalTimes/wslcontainerdesktop
Catalog: src/WslContainerDesktop/Strings/*/Resources.resw
Source language: en_us
Languages: zh_hans

# Resource_Text_fb91e24fa52d
source: Update
zh_hans: 更新

# Resource_Text_fbee6d8e80d2
source: Usage is a snapshot, including stopped containers when metadata is available.
zh_hans: 使用情况是快照，在元数据可用时包含已停止的容器。

# Resource_Text_fe232b5bb527
source: Restart session now?
zh_hans: 立即重启会话？

# Resource_Text_ff17ab13fcd0
source: Saved {0} images to {1}. To bring them back, use Import → Restore saved images….
zh_hans: 已将 {0} 个镜像保存到 {1}。要恢复，请选择导入 → 恢复已保存的镜像…。

# Resource_WslEngine_001.Text
source: WSL engine
zh_hans: WSL 引擎

# Resource_WslEngine_002.Text
source: Restart WSL session
zh_hans: 重启 WSL 会话

# Resource_WslEngine_003.Text
source: Shut down WSL
zh_hans: 关闭 WSL

# Resource_WslEngine_005.Text
source: WSL updates
zh_hans: WSL 更新

# Resource_WslEngine_006.Text
source: Installed version:
zh_hans: 已安装版本：

# Resource_WslEngine_007.Text
source: Latest available:
zh_hans: 最新可用版本：

# Resource_WslEngine_008.Text
source: WSL is up to date.
zh_hans: WSL 已是最新版本。

source: Update now
zh_hans: 立即更新

# Resource_WslEngine_010.Text
source: Update now
zh_hans: 立即更新

# Resource_WslEngine_011.OffContent
source: Stable channel (recommended)
zh_hans: 稳定通道（推荐）

# Resource_WslEngine_011.OnContent
source: Early-access builds included
zh_hans: 包含预览版本

# Resource_WslEngine_012.Text
source: Include early-access (pre-release) WSL builds
zh_hans: 包含 WSL 预览版本

# Resource_WslEngine_013.Text
source: WSL containers are generally available on the stable channel (WSL 3.0.1 or later). Turn this on only to try optional early-access builds, which may be less stable.
zh_hans: WSL 容器已在稳定通道正式发布（WSL 3.0.1 或更高版本）。仅在需要尝试可能不够稳定的预览版本时开启此选项。

# Resource_WslEngine_014.Text
source: Container storage
zh_hans: 容器存储

# Resource_WslEngine_015.Text
source: Location:
zh_hans: 位置：

# Resource_WslEngine_016.Text
source: Session disk size:
zh_hans: 会话磁盘大小：

# Resource_WslEngine_017.Text
source: Changing the location only affects future session storage. Existing images, containers and volumes are not migrated.
zh_hans: 更改位置仅影响后续会话的存储，不会迁移现有镜像、容器或数据卷。

# Resource_WslEngine_018.Content
source: Change location…
zh_hans: 更改位置…

# Resource_WslEngine_019.Content
source: Reset to default
zh_hans: 恢复默认值

# Resource_WslEngine_020.Text
source: Container session settings
zh_hans: 容器会话设置

# Resource_WslEngine_021.Text
source: CPU count:
zh_hans: CPU 数量：

# Resource_WslEngine_022.Text
source: Memory:
zh_hans: 内存：

# Resource_WslEngine_023.Text
source: Max storage:
zh_hans: 最大存储空间：

# Resource_WslEngine_024.Text
source: Default bind address:
zh_hans: 默认绑定地址：

# Resource_WslEngine_025.Text
source: Credential store:
zh_hans: 凭据存储：

# Resource_WslEngine_026.Content
source: Edit settings file
zh_hans: 编辑设置文件

# Resource_WslEngine_027.Text
source: WSL platform
zh_hans: WSL 平台

# Resource_WslEngine_028.Text
source: WSL version:
zh_hans: WSL 版本：

# Resource_WslEngine_029.Text
source: Kernel:
zh_hans: 内核：

# Resource_WslEngine_030.Text
source: Resource limits (.wslconfig)
zh_hans: 资源限制（.wslconfig）

# Resource_WslEngine_031.Text
source: Memory:
zh_hans: 内存：

# Resource_WslEngine_032.Text
source: Processors:
zh_hans: 处理器：

# Resource_WslEngine_033.Text
source: Swap:
zh_hans: 交换空间：

# Resource_WslEngine_034.Text
source: Distributions
zh_hans: 发行版

# Resource_WslEngine_035.Text
source: No WSL distributions are installed.
zh_hans: 尚未安装 WSL 发行版。

# Resource_WslEngine_036.Text
source: Containers don't need one: WSL containers run in their own VM. A distribution is only needed for the optional Kubernetes (k3s) cluster.
zh_hans: WSL 容器在独立虚拟机中运行，无需安装发行版。只有可选的 Kubernetes（k3s）集群需要发行版。

# Resource_WslEngine_037.Content
source: How to install a distribution
zh_hans: 如何安装发行版

# Resource_WslEngine_038.Text
source: Couldn't read the WSL distribution list. Use Refresh to try again.
zh_hans: 无法读取 WSL 发行版列表，请点击刷新重试。

# Resource_WslEngine_Extra1.Title
source: Update available
zh_hans: 有可用更新

# Resource_WslEngine_Extra2.Title
source: Couldn't check for updates
zh_hans: 无法检查更新

# Common_Text0000
source: Automatically launch WSL Container Desktop when you sign in to Windows.
zh_hans: 登录 Windows 时自动启动 WSL Container Desktop。

# Common_Text0001
source: AI features are off
zh_hans: AI 功能已关闭

# Common_Text0002
source: AI features are off by default. Enable them and review the payload preview before sending diagnostics.
zh_hans: AI 功能默认关闭。启用后，请先审阅发送内容的预览，再提交诊断。

# Common_Text0003
source: Unknown
zh_hans: 未知

# Common_Text0004
source: Ollama is set up and selected as your provider.
zh_hans: Ollama 已配置，并已选为你的提供方。

# Common_Text0005
source: Run a model on this machine, or use Provider below to configure a service yourself.
zh_hans: 在本机运行模型，或在下方“提供方”中自行配置服务。

# Common_Text0007
source: Ollama (local container)
zh_hans: Ollama（本地容器）

# Common_Text0009
source: Foundry Local (on Windows)
zh_hans: Foundry Local（在 Windows 上运行）

# Common_Text0010
source: None selected
zh_hans: 未选择

# Common_Text0011
source: AI features are off. Turn them on to use a provider.
zh_hans: AI 功能已关闭。启用后才能使用提供方。

# Common_Text0012
source: Choose a provider below, or use Quick start to run a model on this machine.
zh_hans: 在下方选择提供方，或通过“快速开始”在本机运行模型。

# Common_Text0013
source: Model
zh_hans: 模型

# Common_Text0014
source: Version {0}.{1}.{2}
zh_hans: 版本 {0}.{1}.{2}

# Common_Text0015
source: Version 1.0.0
zh_hans: 版本 1.0.0

# Common_Text0016
source: Let the assistant act without asking?
zh_hans: 允许助手无需询问即可执行操作？

# Common_Text0017
source: The assistant will carry out every action immediately — including removing containers and
zh_hans: 助手会立即执行每项操作，包括移除容器和

# Common_Text0018
source: volumes, and deploying Compose stacks it wrote itself.
zh_hans: 数据卷，以及部署它自己编写的 Compose 应用。

# Common_Text0019
source: You will not be asked again until you turn this back off. Actions still appear in
zh_hans: 在你关闭此设置前，助手不会再次询问。操作仍会显示在

# Common_Text0020
source: Activity, and plans the app cannot apply safely are still refused.
zh_hans: 活动页面中，应用无法安全执行的计划仍会被拒绝。

# Common_Text0021
source: Don't ask me again
zh_hans: 不再询问

# Common_Text0022
source: Keep asking
zh_hans: 继续询问

# Common_Text0023
source: Allow the assistant to delete things?
zh_hans: 允许助手删除资源？

# Common_Text0024
source: The assistant will be able to remove containers, volumes and networks, and delete Kubernetes
zh_hans: 助手将能够移除容器、数据卷和网络，以及删除 Kubernetes

# Common_Text0025
source: resources. Removing a volume destroys the data in it, and none of this can be undone by
zh_hans: 资源。移除数据卷会销毁其中的数据，应用无法撤销

# Common_Text0026
source: the app.
zh_hans: 这些操作。

# Common_Text0027
source: It will still ask before each one unless you also auto-approve that action below.
zh_hans: 除非你还在下方设置了该操作自动批准，否则助手仍会逐项询问。

# Common_Text0028
source: Allow deleting
zh_hans: 允许删除

# Common_Text0029
source: Keep it off
zh_hans: 保持关闭

# Common_Text0030
source: Credential saved
zh_hans: 凭据已保存

# Common_Text0031
source: Saved {0} credential in Windows Credential Manager.
zh_hans: 已将 {0} 凭据保存到 Windows 凭据管理器。

# Common_Text0033
source: Uses only your explicit loopback URL and actual model ID. No API key, cloud fallback, WSLC engine or Ollama container is used for inference.
zh_hans: 仅使用你明确指定的回环地址 URL 和实际模型 ID。推理不使用 API 密钥、云端回退、WSLC 引擎或 Ollama 容器。

# Common_Text0034
source: Uses your logged-in Copilot CLI account. No API key is needed.
zh_hans: 使用已登录的 Copilot CLI 账户，无需 API 密钥。

# Common_Text0035
source: Uses the configured local endpoint and model.
zh_hans: 使用配置的本地端点和模型。

# Common_Text0036
source: No provider selected
zh_hans: 未选择提供方

# Common_Text0037
source: Choose an AI provider to configure diagnostics.
zh_hans: 请选择 AI 提供方以配置诊断。

# Common_Text0038
source: Using {0} with a saved API key.
zh_hans: 使用 {0} 和已保存的 API 密钥。

# Common_Text0039
source: Using {0} with no API key. That is fine for local servers; hosted services such as OpenAI need one.
zh_hans: 使用 {0}，未配置 API 密钥。本地服务可以这样使用，OpenAI 等托管服务则需要密钥。

# Common_Text0040
source: {0} has a saved credential.
zh_hans: {0} 的凭据已保存。

# Common_Text0041
source: No credential is saved for the selected provider.
zh_hans: 所选提供方尚未保存凭据。

# Common_Text0042
source: WSL Container Desktop will launch when you sign in to Windows.
zh_hans: 登录 Windows 时将启动 WSL Container Desktop。

# Common_Text0043
source: Startup is turned off for this app in Windows Task Manager (Startup apps).
zh_hans: 此应用的启动项已在 Windows 任务管理器（启动应用）中关闭。

# Common_Text0044
source: Re-enable it there to allow launching at sign-in.
zh_hans: 请在那里重新启用，以允许登录时启动。

# Common_Text0045
source: Managed by Windows
zh_hans: 由 Windows 管理

# Common_Text0046
source: This app's startup is controlled in Task Manager → Startup apps.
zh_hans: 此应用的启动项由“任务管理器 → 启动应用”控制。

# Common_Text0047
source: Please enable it there.
zh_hans: 请在那里启用。

# Common_Text0048
source: This setting is managed by your organization's policy.
zh_hans: 此设置由组织策略管理。

# Common_Text0049
source: Run at sign-in isn't available for this installation.
zh_hans: 当前安装方式不支持登录时启动。

# Common_Text0050
source: Startup for this app is turned off in Windows Task Manager (Startup apps).
zh_hans: 此应用的启动项已在 Windows 任务管理器（启动应用）中关闭。

# Common_Text0051
source: Enable it there to allow launching at sign-in.
zh_hans: 请在那里启用，以允许登录时启动。

# Common_Text0052
source: Connection OK
zh_hans: 连接成功

# Common_Text0053
source: Connected to WSL container engine. {0}
zh_hans: 已连接到 WSL 容器引擎。 {0}

# Common_Text0054
source: Connection failed
zh_hans: 连接失败

# Common_Text0055
source: Could not reach the WSL container engine using: {0} {1}
zh_hans: 无法通过以下路径连接到 WSL 容器引擎： {0} {1}

# Common_Text0056
source: Enable AI and choose a provider. Capability observations are unknown until checked.
zh_hans: 请启用 AI 并选择提供方。检查前，模型能力仍为未知。

# Common_Text0057
source: AI capabilities: not checked yet
zh_hans: AI 能力：尚未检查

# Common_Text0058
source: AI capabilities: chat and tools ready
zh_hans: AI 能力：对话和工具已就绪

# Common_Text0059
source: AI capabilities: chat ready, tools unconfirmed
zh_hans: AI 能力：对话已就绪，工具尚未确认

# Common_Text0060
source: AI capabilities: provider not usable — see details
zh_hans: AI 能力：提供方不可用，请查看详情

# Common_Text0061
source: AI capabilities: unconfirmed — see details
zh_hans: AI 能力：尚未确认，请查看详情

# Common_Text0062
source: Testing capabilities
zh_hans: 正在测试能力

# Common_Text0063
source: Checking metadata and bounded synthetic chat/tool/JSON requests. Cold starts may take up to 90 seconds. No app actions or downloads run; cancel at any time.
zh_hans: 正在检查元数据，并通过有限的模拟对话、工具和 JSON 请求进行验证。冷启动最多可能需要 90 秒。不执行应用操作或下载，可随时取消。

# Common_Text0064
source: Capability observations
zh_hans: 能力检查结果

# Common_Text0065
source: Test cancelled
zh_hans: 测试已取消

# Common_Text0066
source: The test stopped. Only completed checks can remain cached. No model download or app action was started.
zh_hans: 测试已停止，仅已完成的检查可能保留缓存。未启动模型下载或应用操作。

# Common_Text0067
source: Provider test
zh_hans: 提供方测试

# Common_Text0068
source: GitHub Copilot sign-in
zh_hans: 登录 GitHub Copilot

# Common_Text0069
source: GitHub Copilot uses your logged-in Copilot CLI account. Run `copilot login` outside the app if you need to sign in.
zh_hans: GitHub Copilot 使用已登录的 Copilot CLI 账户。如需登录，请在应用外运行 `copilot login`。

# Common_Text0070
source: Loading models
zh_hans: 正在加载模型

# Common_Text0071
source: Loading GitHub Copilot models…
zh_hans: 正在加载 GitHub Copilot 模型…

# Common_Text0072
source: · reasoning
zh_hans: · 推理

# Common_Text0073
source: {0} (configured)
zh_hans: {0}（已配置）

# Common_Text0074
source: Configured model unavailable
zh_hans: 已配置的模型不可用

# Common_Text0075
source: Configured model '{0}' is not available. Choose a model from the list.
zh_hans: 已配置的模型“{0}”不可用，请从列表中选择模型。

# Common_Text0076
source: Models loaded
zh_hans: 模型已加载

# Common_Text0077
source: Loaded {0} GitHub Copilot model(s).
zh_hans: 已加载 {0} 个 GitHub Copilot 模型。

# Common_Text0078
source: Refresh GitHub Copilot models
zh_hans: 刷新 GitHub Copilot 模型

# Common_Text0079
source: Loading installed Ollama models…
zh_hans: 正在加载已安装的 Ollama 模型…

# Common_Text0080
source: No models installed
zh_hans: 未安装模型

# Common_Text0081
source: No Ollama models are installed. Download one below to use this provider.
zh_hans: 尚未安装 Ollama 模型。请在下方下载模型以使用此提供方。

# Common_Text0082
source: Loaded {0} installed Ollama model(s).
zh_hans: 已加载 {0} 个已安装的 Ollama 模型。

# Common_Text0083
source: Refresh Ollama models
zh_hans: 刷新 Ollama 模型

# Common_Text0084
source: Loading models from the OpenAI-compatible endpoint…
zh_hans: 正在从兼容 OpenAI 的端点加载模型…

# Common_Text0085
source: Refresh OpenAI-compatible models
zh_hans: 刷新兼容 OpenAI 的模型

# Common_Text0086
source: No models listed
zh_hans: 未列出模型

# Common_Text0087
source: The endpoint responded but listed no models. Type the model id your server expects.
zh_hans: 端点已响应，但未列出模型。请输入服务器要求的模型 ID。

# Common_Text0088
source: Loaded {0} model(s) from the OpenAI-compatible endpoint.
zh_hans: 已从兼容 OpenAI 的端点加载 {0} 个模型。

# Common_Text0089
source: Model name required
zh_hans: 需要模型名称

# Common_Text0090
source: Enter a model name to pull (for example qwen2.5:7b).
zh_hans: 请输入要拉取的模型名称，例如 qwen2.5:7b。

# Common_Text0091
source: Download model
zh_hans: 下载模型

# Common_Text0092
source: Download '{0}' to {1}?
zh_hans: 将“{0}”下载到 {1}？

# Common_Text0093
source: Models can be several GB and are downloaded by the Ollama runtime.
zh_hans: 模型可能有数 GB，由 Ollama 运行时下载。

# Common_Text0094
source: Cancel
zh_hans: 取消

# Common_Text0095
source: Download cancelled
zh_hans: 下载已取消

# Common_Text0096
source: No model was downloaded.
zh_hans: 未下载模型。

# Common_Text0097
source: Model pulled
zh_hans: 模型已拉取

# Common_Text0098
source: Pulled '{0}' and selected it.
zh_hans: 已拉取并选择“{0}”。

# Common_Text0099
source: Pull Ollama model
zh_hans: 拉取 Ollama 模型

# Common_Text0100
source: Pulling model
zh_hans: 正在拉取模型

# Common_Text0101
source: Pulling '{0}'…
zh_hans: 正在拉取“{0}”…

# Common_Text0102
source: Pull model
zh_hans: 拉取模型

# Common_Text0103
source: Pull failed
zh_hans: 拉取失败

# Common_Text0104
source: Unknown error.
zh_hans: 未知错误。

# Common_Text0105
source: Pulling {0}: {1} {2:0}% ({3} / {4})
zh_hans: 正在拉取 {0}：{1} {2:0}%（{3} / {4}）

# Common_Text0106
source: Pulling {0}: {1}
zh_hans: 正在拉取 {0}：{1}

# Common_Text0107
source: Pull incomplete
zh_hans: 拉取未完成

# Common_Text0108
source: The server closed the progress stream without confirming success. Refresh installed models before retrying.
zh_hans: 服务器关闭了进度流，但未确认成功。请先刷新已安装模型，再重试。

# Common_Text0109
source: Setting up local AI
zh_hans: 正在配置本地 AI

# Common_Text0110
source: Verifying the app-owned Ollama container…
zh_hans: 正在验证应用管理的 Ollama 容器…

# Common_Text0111
source: Local AI setup cancelled
zh_hans: 本地 AI 配置已取消

# Common_Text0112
source: Local AI setup failed
zh_hans: 本地 AI 配置失败

# Common_Text0113
source: Waiting for the owned Ollama runtime API…
zh_hans: 正在等待应用管理的 Ollama 运行时 API…

# Common_Text0114
source: The owned container started but its API did not become ready in time. The container may still be running. Check its logs before retrying or removing it.
zh_hans: 应用管理的容器已启动，但 API 未及时就绪。容器可能仍在运行。请先检查日志，再重试或移除。

# Common_Text0115
source: Reading installed model metadata…
zh_hans: 正在读取已安装模型的元数据…

# Common_Text0116
source: Download a model?
zh_hans: 下载模型？

# Common_Text0117
source: The runtime is ready but has no model yet, so it cannot answer anything.
zh_hans: 运行时已就绪，但尚无模型，因此无法回答问题。

# Common_Text0118
source: Download {0}? It is a small chat model that supports tool calling, so the AI assistant can work.
zh_hans: 下载 {0}？这是支持工具调用的小型对话模型，可供 AI 助手使用。

# Common_Text0119
source: • About 5 GB, downloaded by the Ollama runtime
zh_hans: • 大约 5 GB，由 Ollama 运行时下载

# Common_Text0120
source: • You can pick a different model later under Provider
zh_hans: • 稍后可在“提供方”中选择其他模型

# Common_Text0121
source: Download {0}
zh_hans: 下载 {0}

# Common_Text0122
source: Skip for now
zh_hans: 暂时跳过

# Common_Text0123
source: No model is installed yet, so the assistant stays hidden. Download one under Provider below to finish.
zh_hans: 尚未安装模型，因此助手保持隐藏。请在下方“提供方”中下载模型以完成配置。

# Common_Text0124
source: Using model '{0}'.
zh_hans: 正在使用模型“{0}”。

# Common_Text0125
source: Ollama is ready
zh_hans: Ollama 已就绪

# Common_Text0126
source: {0} Checking what this model supports…
zh_hans: {0} 正在检查此模型支持的能力…

# Common_Text0127
source: Using model '{0}'. Tool calling is supported, so the AI assistant is available from the toolbar.
zh_hans: 正在使用模型“{0}”。模型支持工具调用，可从工具栏打开 AI 助手。

# Common_Text0128
source: Ollama is ready, assistant unavailable
zh_hans: Ollama 已就绪，助手不可用

# Common_Text0129
source: Using model '{0}', but tool calling was not confirmed, so the assistant stays hidden.
zh_hans: 正在使用模型“{0}”，但尚未确认工具调用能力，因此助手保持隐藏。

# Common_Text0130
source: Try a tool-capable model such as qwen2.5:7b, or use Test capabilities for details.
zh_hans: 请尝试 qwen2.5:7b 等支持工具的模型，或使用“测试能力”查看详情。

# Common_Text0131
source: Using model '{0}'. Capabilities were not checked; use Test capabilities below.
zh_hans: 正在使用模型“{0}”。尚未检查能力，请使用下方“测试能力”。

# Common_Text0132
source: Setup was cancelled. The owned container may still be running and model data may be retained. Check the runtime before retrying or removing local AI. No model download or warm-up was requested.
zh_hans: 配置已取消。应用管理的容器可能仍在运行，模型数据也可能已保留。请先检查运行时，再重试或移除本地 AI。未请求模型下载或预热。

# Common_Text0133
source: Set up local AI
zh_hans: 配置本地 AI

# Common_Text0134
source: Remove Ollama
zh_hans: 移除 Ollama

# Common_Text0135
source: This removes the app's '{0}' container.
zh_hans: 这将移除应用管理的“{0}”容器。

# Common_Text0136
source: Ollama installed outside this app, other containers, and remote endpoints are not touched.
zh_hans: 不会影响应用外安装的 Ollama、其他容器或远程端点。

# Common_Text0137
source: Delete downloaded models too?
zh_hans: 同时删除已下载的模型？

# Common_Text0138
source: Downloaded models can be several GB.
zh_hans: 已下载的模型可能占用数 GB。

# Common_Text0139
source: Delete them to free the space, or keep them so setting up again is fast.
zh_hans: 删除模型可释放空间，保留模型则可在下次配置时快速复用。

# Common_Text0140
source: Delete models
zh_hans: 删除模型

# Common_Text0141
source: Keep models
zh_hans: 保留模型

# Common_Text0142
source: Removing local AI
zh_hans: 正在移除本地 AI

# Common_Text0143
source: Removing the local AI container…
zh_hans: 正在移除本地 AI 容器…

# Common_Text0144
source: Ollama removed
zh_hans: Ollama 已移除

# Common_Text0145
source: Ollama removed, models kept
zh_hans: Ollama 已移除，模型已保留

# Common_Text0146
source: Could not remove Ollama
zh_hans: 无法移除 Ollama

# Common_Text0147
source: Remove local AI
zh_hans: 移除本地 AI

# Common_Text0148
source: Read installed Ollama models
zh_hans: 读取已安装的 Ollama 模型

# Common_Text0149
source: {0} (not installed)
zh_hans: {0}（未安装）

# Common_Text0150
source: Not refreshed. Enter the actual runtime URL and model ID. No default port or model is assumed.
zh_hans: 尚未刷新。请输入实际运行时 URL 和模型 ID，不预设端口或模型。

# Common_Text0151
source: No runtime operation requested.
zh_hans: 尚未请求运行时操作。

# Common_Text0152
source: Discovery is read-only and runs only when requested.
zh_hans: 发现操作为只读，仅在请求时运行。

# Common_Text0153
source: Setup cache:
zh_hans: 配置缓存：

# Common_Text0154
source: Model-file staging (not the Foundry runtime cache):
zh_hans: 模型文件暂存位置（非 Foundry 运行时缓存）：

# Common_Text0155
source: Configuration changed. Refresh metadata; cached observations were cleared.
zh_hans: 配置已更改。请刷新元数据，缓存的检查结果已清除。

# Common_Text0156
source: No operation requested for this configuration.
zh_hans: 尚未对此配置请求操作。

# Common_Text0157
source: Provider changed. Refresh metadata after selecting Foundry Local.
zh_hans: 提供方已更改。选择 Foundry Local 后请刷新元数据。

# Common_Text0158
source: Pending requests cancelled. Refresh observed state; completed actions are not rolled back.
zh_hans: 待处理请求已取消。请刷新检查状态；已完成的操作不会回滚。

# Common_Text0159
source: Configuration changed; model-file preparation cancelled. Completed and partial staging data are retained.
zh_hans: 配置已更改，模型文件准备已取消。已完成及部分暂存的数据均已保留。

# Common_Text0160
source: Configuration changed; runtime setup cancelled. Windows deployment may still complete. Inspect installed packages before retrying.
zh_hans: 配置已更改，运行时配置已取消。Windows 部署可能仍会完成，重试前请检查已安装的软件包。

# Common_Text0161
source: Configuration changed. Discover again before connecting; no runtime operation requested for these settings.
zh_hans: 配置已更改。连接前请重新发现；尚未对此配置请求运行时操作。

# Common_Text0162
source: Initial CPU model is loaded; run independent capability checks before assistant use.
zh_hans: 初始 CPU 模型已加载。使用助手前请独立检查模型能力。

# Common_Text0163
source: Cancelled. Runtime/model state may have changed; files and packages retained.
zh_hans: 已取消。运行时或模型状态可能已改变，文件和软件包已保留。

# Common_Text0164
source: Preparation failed:
zh_hans: 准备失败：

# Common_Text0165
source: No automatic rollback or retry.
zh_hans: 不会自动回滚或重试。

# Common_Text0166
source: Preparing pinned model-file download; no network until you confirm…
zh_hans: 正在准备固定版本的模型文件下载，确认前不会连接网络…

# Common_Text0167
source: Preparing runtime-only installation; no downloads or registration until you confirm…
zh_hans: 正在准备仅安装运行时，确认前不会下载或注册…

# Common_Text0168
source: Unexpected preparation failure. No automatic retry or cleanup. Inspect retained setup cache and any requested Windows registration before retrying.
zh_hans: 准备时发生意外错误。不会自动重试或清理，重试前请检查保留的配置缓存和已请求的 Windows 注册。

# Common_Text0169
source: Discovering the existing standalone CLI/server; no installation or start requested…
zh_hans: 正在发现已有的独立 CLI 或服务器，未请求安装或启动…

# Common_Text0170
source: Review and confirm to change the endpoint setting.
zh_hans: 请审阅并确认端点设置的更改。

# Common_Text0171
source: Enter an exact model ID advertised by this server, then discover again. No model was selected automatically.
zh_hans: 请输入此服务器公布的准确模型 ID，然后重新发现。未自动选择模型。

# Common_Text0172
source: Discovered catalog IDs (up to 100):
zh_hans: 发现的目录 ID（最多 100 个）：

# Common_Text0173
source: Discovery cancelled or timed out. Settings and external runtime were not changed.
zh_hans: 发现操作已取消或超时。未更改设置或外部运行时。

# Common_Text0174
source: Discovery failed:
zh_hans: 发现失败：

# Common_Text0175
source: Settings and runtime were not changed. Enter the actual endpoint manually or inspect the standalone installation.
zh_hans: 未更改设置或运行时。请手动输入实际端点，或检查独立安装。

# Common_Text0176
source: Confirmed endpoint saved. Model selection preserved; no runtime or model was changed. Refresh metadata and test capabilities before inference.
zh_hans: 已保存确认的端点。模型选择已保留，未更改运行时或模型。推理前请刷新元数据并测试能力。

# Common_Text0177
source: Connection was not confirmed. Inspect settings and discover again.
zh_hans: 连接尚未确认。请检查设置并重新发现。

# Common_Text0178
source: Reading metadata only…
zh_hans: 仅正在读取元数据…

# Common_Text0179
source: Requesting model memory change…
zh_hans: 正在请求更改模型内存状态…

# Common_Text0180
source: {0} | cached: {1} | loaded: {2}
zh_hans: {0} | 已缓存：{1} | 已加载：{2}

# Common_Text0181
source: version: {0}; size MB: {1}; license: {2}
zh_hans: 版本：{0}；大小 MB：{1}；许可证：{2}

# Common_Text0182
source: license information: {0}; task: {1}; format: {2}
zh_hans: 许可证信息：{0}；任务：{1}；格式：{2}

# Common_Text0183
source: hardware target: {0}; EP: {1} (advertised, not validated); tools advertised: {2}
zh_hans: 硬件目标：{0}；执行提供方：{1}（已声明，未验证）；已声明的工具能力：{2}

# Common_Text0184
source: Catalog: {0}; cached: {1}; loaded: {2}.
zh_hans: 目录：{0}；已缓存：{1}；已加载：{2}。

# Common_Text0185
source: Cached IDs: {0} Loaded IDs: {1}
zh_hans: 已缓存 ID：{0} 已加载 ID：{1}

# Common_Text0186
source: Showing up to 100 catalog entries. Registered external entries are not eligible for local inference.
zh_hans: 最多显示 100 个目录条目。已注册的外部条目不能用于本地推理。

# Common_Text0187
source: Metadata refreshed. No load, download or inference was requested.
zh_hans: 元数据已刷新。未请求加载、下载或推理。

# Common_Text0188
source: Request cancelled or timed out. Memory/model state is unknown until refreshed; completed actions are not rolled back.
zh_hans: 请求已取消或超时。刷新前，内存或模型状态未知；已完成的操作不会回滚。

# Common_Text0189
source: Unexpected Foundry Local error.
zh_hans: Foundry Local 发生意外错误。

# Common_Text0190
source: No fallback or acquisition was attempted. Refresh state before retrying.
zh_hans: 未尝试回退或获取运行时。请刷新状态后重试。

# Common_Text0191
source: unknown
zh_hans: 未知
